Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::Transition Class Referencefinal
MEP Element Manager
The Transition is an element that connects two different Routing Segments. More...
#include <MEPTransition.hpp>
 Inheritance diagram for ACAPI::MEP::Transition:
 Public Member Functions
std::optional< double >  | GetInsulationThickness () const
double  | GetAngle () const
double  | GetLength () const
double  | GetOffsetY () const
double  | GetOffsetZ () const
UniqueID  | GetNarrowerPortID () const
UniqueID  | GetWiderPortID () const
UniqueID  | GetRoutingNodeId () const
Domain  | GetDomain () const
TransitionDefault  | PickUpDefault () const
Picks up and returns the Default of the Transition.
Result< UniqueID >  | GetPreferenceTable () const
bool  | IsControlledByPreference () const
 Public Member Functions inherited from ACAPI::MEP::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Public Member Functions inherited from ACAPI::ElementBase
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< Transition >  | Get (const UniqueID &uniqueId)
Returns a Transition.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs an ElementBase with an element base implementation.
 Protected Member Functions inherited from ACAPI::ElementBase
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The Transition is an element that connects two different Routing Segments.
Routing Segments can differ from each other in size or shape.
Since
Archicad 27
Example code snippet from Test/New MEP
Getters
 ACAPI::Result<Transition> transition = Transition::Get (id);
 if (transition.IsErr ()) {
 ACAPI_WriteReport (transition.UnwrapErr ().text.c_str (), false);
 return;
 }
 Reporter transitionReporter (3);
 transitionReporter.Add ("Transition id", id);
 transitionReporter.SetTabCount (4);
 transitionReporter.Add ("Angle", transition->GetAngle ());
 transitionReporter.Add ("Length", transition->GetLength ());
 transitionReporter.Add ("Offset Y", transition->GetOffsetY ());
 transitionReporter.Add ("Offset Z", transition->GetOffsetZ ());
 transitionReporter.Add ("Id of the narrower Port", transition->GetNarrowerPortID ());
 transitionReporter.Add ("Id of the wider Port", transition->GetWiderPortID ());
 transitionReporter.Write ();
 Labeling
 for (const UniqueID& transitionId : routingSegment->GetTransitionIds ()) {
 const API_Guid transitionGuid = GSGuid2APIGuid (transitionId.GetGuid ());
 const API_Guid labeledElemGuid = isSectElem ? elemIdToSectElemId.Get (transitionGuid, APINULLGuid) : transitionGuid;
 const API_Guid labelGuid = PlaceLabelOn (labeledElemGuid);
 if (labelGuid == APINULLGuid)
 return Error;
 GS::Array<API_Guid> connectedLabels;
 ERRCHK_NO_ASSERT (ACAPI_Grouping_GetConnectedElements (labeledElemGuid, API_LabelID, &connectedLabels));
 if (!connectedLabels.Contains (labelGuid))
 return Error;
 }
Member Function Documentation
◆ Get()
 static Result< Transition > ACAPI::MEP::Transition::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a Transition.
Parameters
uniqueId | The UniqueID of the requested Transition.
Returns
If the uniqueId belongs to a Transition, returns the object associated to it, otherwise Error.
◆ GetAngle()
 double ACAPI::MEP::Transition::GetAngle  |  ( |   | ) |   const
Returns
Returns the angle of the Transition in degrees.
◆ GetDomain()
 Domain ACAPI::MEP::Transition::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the element.
◆ GetInsulationThickness()
 std::optional< double > ACAPI::MEP::Transition::GetInsulationThickness  |  ( |   | ) |   const
Returns
Returns the insulation thickness if the Transition has insulation, otherwise std::nullopt. Transition of cable carrier domain cannot have insulation.
◆ GetLength()
 double ACAPI::MEP::Transition::GetLength  |  ( |   | ) |   const
Returns
Returns the length of the Transition.
◆ GetNarrowerPortID()
 UniqueID ACAPI::MEP::Transition::GetNarrowerPortID  |  ( |   | ) |   const
Returns
Returns the ID of the narrower port.
◆ GetOffsetY()
 double ACAPI::MEP::Transition::GetOffsetY  |  ( |   | ) |   const
Returns
Returns the offset of the Transition in the Y direction.
◆ GetOffsetZ()
 double ACAPI::MEP::Transition::GetOffsetZ  |  ( |   | ) |   const
Returns
Returns the offset of the Transition in the Z direction.
◆ GetPreferenceTable()
 Result< UniqueID > ACAPI::MEP::Transition::GetPreferenceTable  |  ( |   | ) |   const
Returns
Returns the UniqueID of the PreferenceTable if a DuctTransition or a PipeTransition, in the case of CableCarrierTransition returns Error.
◆ GetRoutingNodeId()
 UniqueID ACAPI::MEP::Transition::GetRoutingNodeId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the RoutingNode that it belongs to.
◆ GetWiderPortID()
 UniqueID ACAPI::MEP::Transition::GetWiderPortID  |  ( |   | ) |   const
Returns
Returns the ID of the wider port.
◆ IsControlledByPreference()
 bool ACAPI::MEP::Transition::IsControlledByPreference  |  ( |   | ) |   const
Returns
Returns whether the transition is calculated with the help of preference table.
◆ PickUpDefault()
 TransitionDefault ACAPI::MEP::Transition::PickUpDefault  |  ( |   | ) |   const
Picks up and returns the Default of the Transition.
Returns
Returns a TransitionDefault with the parameters of the object it was called for.